modm-ext/data.modm.io/docs/svd/header_stm32g4a1xx.svd
        <register>
          <name>ICR</name>
          <description>UCPD interrupt flag clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXMSGDISCCF</name>
              <description>Tx message discarded flag (TXMSGDISC) clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGSENTCF</name>
              <description>Tx message sent flag (TXMSGSENT) clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXMSGABTCF</name>
              <description>Tx message abort flag (TXMSGABT) clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTDISCCF</name>
              <description>Hard reset discarded flag (HRSTDISC) clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRSTSENTCF</name>
              <description>Hard reset sent flag (HRSTSENT) clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUNDCF</name>
              <description>Tx underflow flag (TXUND) clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXORDDETCF</name>
              <description>Rx ordered set detect flag (RXORDDET) clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXHRSTDETCF</name>
              <description>Rx Hard Reset detected flag (RXHRSTDET) clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVRCF</name>
              <description>Rx overflow flag (RXOVR) clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXMSGENDCF</name>
              <description>Rx message received flag (RXMSGEND) clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT1CF</name>
              <description>TypeC event (CC1) flag (TYPECEVT1) clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TYPECEVT2CF</name>
              <description>TypeC event (CC2) flag (TYPECEVT2) clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSEVTCF</name>
              <description>Fast Role Swap event flag clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_ORDSET</name>
          <description>UCPD Tx ordered set type register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXORDSET</name>
              <description>Tx Ordered Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_PAYSZ</name>
          <description>UCPD Tx payload size register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXPAYSZ</name>
              <description>Tx payload size in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDR</name>
          <description>UCPD Tx data register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>Tx Data Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ORDSET</name>
          <description>UCPD Rx ordered set type register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXORDSET</name>
              <description>Rx Ordered Set Code detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOP</name>
                  <description>SOP code detected in receiver</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1</name>
                  <description>SOP' code detected in receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2</name>
                  <description>SOP'' code detected in receiver</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP1_DEBUG</name>
                  <description>SOP' Debug code detected in receiver</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP2_DEBUG</name>
                  <description>SOP'' Debug code detected in receiver</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CABLE_RESET</name>
                  <description>Cable Reset code detected in receiver</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPEXT1</name>
                  <description>SOP extension#1 code detected in receiver</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOPEXT2</name>
                  <description>SOP extension#2 code detected in receiver</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXSOP3OF4</name>
              <description>Rx Ordered Set Debug indication</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSOPKINVALID</name>
              <description>Rx Ordered Set corrupted K-Codes (Debug)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_PAYSZ</name>
          <description>UCPD Rx payload size register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXPAYSZ</name>
              <description>Rx payload size in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDR</name>
          <description>UCPD Rx data register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>8-bit receive data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ORDEXT1</name>
          <description>UCPD Rx ordered set extension 1 register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXSOPX1</name>
              <description>RX Ordered Set Extension Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_ORDEXT2</name>
          <description>UCPD Rx ordered set extension 2 register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXSOPX2</name>
              <description>RX Ordered Set Extension Register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
